STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255cxx_cm33.h
/*******************  Bit definition for DSI_ISR0 register  *******************/
#define DSI_ISR0_AE0_Pos            (0U)
#define DSI_ISR0_AE0_Msk            (0x1UL << DSI_ISR0_AE0_Pos)           /*!< 0x00000001 */
#define DSI_ISR0_AE0                DSI_ISR0_AE0_Msk                     /*!< Acknowledge error 0 */
#define DSI_ISR0_AE1_Pos            (1U)
#define DSI_ISR0_AE1_Msk            (0x1UL << DSI_ISR0_AE1_Pos)           /*!< 0x00000002 */
#define DSI_ISR0_AE1                DSI_ISR0_AE1_Msk                     /*!< Acknowledge error 1 */
#define DSI_ISR0_AE2_Pos            (2U)
#define DSI_ISR0_AE2_Msk            (0x1UL << DSI_ISR0_AE2_Pos)           /*!< 0x00000004 */
#define DSI_ISR0_AE2                DSI_ISR0_AE2_Msk                     /*!< Acknowledge error 2 */
#define DSI_ISR0_AE3_Pos            (3U)
#define DSI_ISR0_AE3_Msk            (0x1UL << DSI_ISR0_AE3_Pos)           /*!< 0x00000008 */
#define DSI_ISR0_AE3                DSI_ISR0_AE3_Msk                     /*!< Acknowledge error 3 */
#define DSI_ISR0_AE4_Pos            (4U)
#define DSI_ISR0_AE4_Msk            (0x1UL << DSI_ISR0_AE4_Pos)           /*!< 0x00000010 */
#define DSI_ISR0_AE4                DSI_ISR0_AE4_Msk                     /*!< Acknowledge error 4 */
#define DSI_ISR0_AE5_Pos            (5U)
#define DSI_ISR0_AE5_Msk            (0x1UL << DSI_ISR0_AE5_Pos)           /*!< 0x00000020 */
#define DSI_ISR0_AE5                DSI_ISR0_AE5_Msk                     /*!< Acknowledge error 5 */
#define DSI_ISR0_AE6_Pos            (6U)
#define DSI_ISR0_AE6_Msk            (0x1UL << DSI_ISR0_AE6_Pos)           /*!< 0x00000040 */
#define DSI_ISR0_AE6                DSI_ISR0_AE6_Msk                     /*!< Acknowledge error 6 */
#define DSI_ISR0_AE7_Pos            (7U)
#define DSI_ISR0_AE7_Msk            (0x1UL << DSI_ISR0_AE7_Pos)           /*!< 0x00000080 */
#define DSI_ISR0_AE7                DSI_ISR0_AE7_Msk                     /*!< Acknowledge error 7 */
#define DSI_ISR0_AE8_Pos            (8U)
#define DSI_ISR0_AE8_Msk            (0x1UL << DSI_ISR0_AE8_Pos)           /*!< 0x00000100 */
#define DSI_ISR0_AE8                DSI_ISR0_AE8_Msk                     /*!< Acknowledge error 8 */
#define DSI_ISR0_AE9_Pos            (9U)
#define DSI_ISR0_AE9_Msk            (0x1UL << DSI_ISR0_AE9_Pos)           /*!< 0x00000200 */
#define DSI_ISR0_AE9                DSI_ISR0_AE9_Msk                     /*!< Acknowledge error 9 */
#define DSI_ISR0_AE10_Pos           (10U)
#define DSI_ISR0_AE10_Msk           (0x1UL << DSI_ISR0_AE10_Pos)          /*!< 0x00000400 */
#define DSI_ISR0_AE10               DSI_ISR0_AE10_Msk                    /*!< Acknowledge error 10 */
#define DSI_ISR0_AE11_Pos           (11U)
#define DSI_ISR0_AE11_Msk           (0x1UL << DSI_ISR0_AE11_Pos)          /*!< 0x00000800 */
#define DSI_ISR0_AE11               DSI_ISR0_AE11_Msk                    /*!< Acknowledge error 11 */
#define DSI_ISR0_AE12_Pos           (12U)
#define DSI_ISR0_AE12_Msk           (0x1UL << DSI_ISR0_AE12_Pos)          /*!< 0x00001000 */
#define DSI_ISR0_AE12               DSI_ISR0_AE12_Msk                    /*!< Acknowledge error 12 */
#define DSI_ISR0_AE13_Pos           (13U)
#define DSI_ISR0_AE13_Msk           (0x1UL << DSI_ISR0_AE13_Pos)          /*!< 0x00002000 */
#define DSI_ISR0_AE13               DSI_ISR0_AE13_Msk                    /*!< Acknowledge error 13 */
#define DSI_ISR0_AE14_Pos           (14U)
#define DSI_ISR0_AE14_Msk           (0x1UL << DSI_ISR0_AE14_Pos)          /*!< 0x00004000 */
#define DSI_ISR0_AE14               DSI_ISR0_AE14_Msk                    /*!< Acknowledge error 14 */
#define DSI_ISR0_AE15_Pos           (15U)
#define DSI_ISR0_AE15_Msk           (0x1UL << DSI_ISR0_AE15_Pos)          /*!< 0x00008000 */
#define DSI_ISR0_AE15               DSI_ISR0_AE15_Msk                    /*!< Acknowledge error 15 */
#define DSI_ISR0_PE0_Pos            (16U)
#define DSI_ISR0_PE0_Msk            (0x1UL << DSI_ISR0_PE0_Pos)           /*!< 0x00010000 */
#define DSI_ISR0_PE0                DSI_ISR0_PE0_Msk                     /*!< PHY error 0 */
#define DSI_ISR0_PE1_Pos            (17U)
#define DSI_ISR0_PE1_Msk            (0x1UL << DSI_ISR0_PE1_Pos)           /*!< 0x00020000 */
#define DSI_ISR0_PE1                DSI_ISR0_PE1_Msk                     /*!< PHY error 1 */
#define DSI_ISR0_PE2_Pos            (18U)
#define DSI_ISR0_PE2_Msk            (0x1UL << DSI_ISR0_PE2_Pos)           /*!< 0x00040000 */
#define DSI_ISR0_PE2                DSI_ISR0_PE2_Msk                     /*!< PHY error 2 */
#define DSI_ISR0_PE3_Pos            (19U)
#define DSI_ISR0_PE3_Msk            (0x1UL << DSI_ISR0_PE3_Pos)           /*!< 0x00080000 */
#define DSI_ISR0_PE3                DSI_ISR0_PE3_Msk                     /*!< PHY error 3 */
#define DSI_ISR0_PE4_Pos            (20U)
#define DSI_ISR0_PE4_Msk            (0x1UL << DSI_ISR0_PE4_Pos)           /*!< 0x00100000 */
#define DSI_ISR0_PE4                DSI_ISR0_PE4_Msk                     /*!< PHY error 4 */

/*******************  Bit definition for DSI_ISR1 register  *******************/
#define DSI_ISR1_TOHSTX_Pos         (0U)
#define DSI_ISR1_TOHSTX_Msk         (0x1UL << DSI_ISR1_TOHSTX_Pos)        /*!< 0x00000001 */
#define DSI_ISR1_TOHSTX             DSI_ISR1_TOHSTX_Msk                  /*!< Timeout high-speed transmission */
#define DSI_ISR1_TOLPRX_Pos         (1U)
#define DSI_ISR1_TOLPRX_Msk         (0x1UL << DSI_ISR1_TOLPRX_Pos)        /*!< 0x00000002 */
#define DSI_ISR1_TOLPRX             DSI_ISR1_TOLPRX_Msk                  /*!< Timeout low-power reception */
#define DSI_ISR1_ECCSE_Pos          (2U)
#define DSI_ISR1_ECCSE_Msk          (0x1UL << DSI_ISR1_ECCSE_Pos)         /*!< 0x00000004 */
#define DSI_ISR1_ECCSE              DSI_ISR1_ECCSE_Msk                   /*!< ECC single-bit error */
#define DSI_ISR1_ECCME_Pos          (3U)
#define DSI_ISR1_ECCME_Msk          (0x1UL << DSI_ISR1_ECCME_Pos)         /*!< 0x00000008 */
#define DSI_ISR1_ECCME              DSI_ISR1_ECCME_Msk                   /*!< ECC multi-bit error */
#define DSI_ISR1_CRCE_Pos           (4U)
#define DSI_ISR1_CRCE_Msk           (0x1UL << DSI_ISR1_CRCE_Pos)          /*!< 0x00000010 */
#define DSI_ISR1_CRCE               DSI_ISR1_CRCE_Msk                    /*!< CRC error */
#define DSI_ISR1_PSE_Pos            (5U)
#define DSI_ISR1_PSE_Msk            (0x1UL << DSI_ISR1_PSE_Pos)           /*!< 0x00000020 */
#define DSI_ISR1_PSE                DSI_ISR1_PSE_Msk                     /*!< Packet size error */
#define DSI_ISR1_EOTPE_Pos          (6U)
#define DSI_ISR1_EOTPE_Msk          (0x1UL << DSI_ISR1_EOTPE_Pos)         /*!< 0x00000040 */
#define DSI_ISR1_EOTPE              DSI_ISR1_EOTPE_Msk                   /*!< EoTp error */
#define DSI_ISR1_LPWRE_Pos          (7U)
#define DSI_ISR1_LPWRE_Msk          (0x1UL << DSI_ISR1_LPWRE_Pos)         /*!< 0x00000080 */
#define DSI_ISR1_LPWRE              DSI_ISR1_LPWRE_Msk                   /*!< LTDC payload write error */
#define DSI_ISR1_GCWRE_Pos          (8U)
#define DSI_ISR1_GCWRE_Msk          (0x1UL << DSI_ISR1_GCWRE_Pos)         /*!< 0x00000100 */
#define DSI_ISR1_GCWRE              DSI_ISR1_GCWRE_Msk                   /*!< Generic command write error */
#define DSI_ISR1_GPWRE_Pos          (9U)
#define DSI_ISR1_GPWRE_Msk          (0x1UL << DSI_ISR1_GPWRE_Pos)         /*!< 0x00000200 */
#define DSI_ISR1_GPWRE              DSI_ISR1_GPWRE_Msk                   /*!< Generic payload write error */
#define DSI_ISR1_GPTXE_Pos          (10U)
#define DSI_ISR1_GPTXE_Msk          (0x1UL << DSI_ISR1_GPTXE_Pos)         /*!< 0x00000400 */
#define DSI_ISR1_GPTXE              DSI_ISR1_GPTXE_Msk                   /*!< Generic payload transmit error */
#define DSI_ISR1_GPRDE_Pos          (11U)
#define DSI_ISR1_GPRDE_Msk          (0x1UL << DSI_ISR1_GPRDE_Pos)         /*!< 0x00000800 */
#define DSI_ISR1_GPRDE              DSI_ISR1_GPRDE_Msk                   /*!< Generic payload read error */
#define DSI_ISR1_GPRXE_Pos          (12U)
#define DSI_ISR1_GPRXE_Msk          (0x1UL << DSI_ISR1_GPRXE_Pos)         /*!< 0x00001000 */
#define DSI_ISR1_GPRXE              DSI_ISR1_GPRXE_Msk                   /*!< Generic payload receive error */
#define DSI_ISR1_DCFFE_Pos          (13U)
#define DSI_ISR1_DCFFE_Msk          (0x1UL << DSI_ISR1_DCFFE_Pos)         /*!< 0x00002000 */
#define DSI_ISR1_DCFFE              DSI_ISR1_DCFFE_Msk                   /*!< DBI command FIFO full error */
#define DSI_ISR1_DDFFE_Pos          (14U)
#define DSI_ISR1_DDFFE_Msk          (0x1UL << DSI_ISR1_DDFFE_Pos)         /*!< 0x00004000 */
#define DSI_ISR1_DDFFE              DSI_ISR1_DDFFE_Msk                   /*!< DBI data FIFO full error */
#define DSI_ISR1_DRUE_Pos           (15U)
#define DSI_ISR1_DRUE_Msk           (0x1UL << DSI_ISR1_DRUE_Pos)          /*!< 0x00008000 */
#define DSI_ISR1_DRUE               DSI_ISR1_DRUE_Msk                    /*!< DCS read underflow error */
#define DSI_ISR1_DROE_Pos           (16U)
#define DSI_ISR1_DROE_Msk           (0x1UL << DSI_ISR1_DROE_Pos)          /*!< 0x00010000 */
#define DSI_ISR1_DROE               DSI_ISR1_DROE_Msk                    /*!< DBI read overflow error */
#define DSI_ISR1_DICE_Pos           (17U)
#define DSI_ISR1_DICE_Msk           (0x1UL << DSI_ISR1_DICE_Pos)          /*!< 0x00020000 */
#define DSI_ISR1_DICE               DSI_ISR1_DICE_Msk                    /*!< DBI illegal command error */
#define DSI_ISR1_VMPUE_Pos          (19U)
#define DSI_ISR1_VMPUE_Msk          (0x1UL << DSI_ISR1_VMPUE_Pos)         /*!< 0x00080000 */
#define DSI_ISR1_VMPUE              DSI_ISR1_VMPUE_Msk                   /*!< Video mode underflow error */
#define DSI_ISR1_TEE_Pos            (20U)
#define DSI_ISR1_TEE_Msk            (0x1UL << DSI_ISR1_TEE_Pos)           /*!< 0x00100000 */
#define DSI_ISR1_TEE                DSI_ISR1_TEE_Msk                     /*!< Tear effect error */

/*******************  Bit definition for DSI_IER0 register  *******************/
#define DSI_IER0_AE0IE_Pos          (0U)
#define DSI_IER0_AE0IE_Msk          (0x1UL << DSI_IER0_AE0IE_Pos)         /*!< 0x00000001 */
#define DSI_IER0_AE0IE              DSI_IER0_AE0IE_Msk                   /*!< Acknowledge error 0 interrupt enable */
#define DSI_IER0_AE1IE_Pos          (1U)
#define DSI_IER0_AE1IE_Msk          (0x1UL << DSI_IER0_AE1IE_Pos)         /*!< 0x00000002 */
#define DSI_IER0_AE1IE              DSI_IER0_AE1IE_Msk                   /*!< Acknowledge error 1 interrupt enable */
#define DSI_IER0_AE2IE_Pos          (2U)
#define DSI_IER0_AE2IE_Msk          (0x1UL << DSI_IER0_AE2IE_Pos)         /*!< 0x00000004 */
#define DSI_IER0_AE2IE              DSI_IER0_AE2IE_Msk                   /*!< Acknowledge error 2 interrupt enable */
#define DSI_IER0_AE3IE_Pos          (3U)
#define DSI_IER0_AE3IE_Msk          (0x1UL << DSI_IER0_AE3IE_Pos)         /*!< 0x00000008 */
#define DSI_IER0_AE3IE              DSI_IER0_AE3IE_Msk                   /*!< Acknowledge error 3 interrupt enable */
#define DSI_IER0_AE4IE_Pos          (4U)
#define DSI_IER0_AE4IE_Msk          (0x1UL << DSI_IER0_AE4IE_Pos)         /*!< 0x00000010 */
#define DSI_IER0_AE4IE              DSI_IER0_AE4IE_Msk                   /*!< Acknowledge error 4 interrupt enable */
#define DSI_IER0_AE5IE_Pos          (5U)
#define DSI_IER0_AE5IE_Msk          (0x1UL << DSI_IER0_AE5IE_Pos)         /*!< 0x00000020 */
#define DSI_IER0_AE5IE              DSI_IER0_AE5IE_Msk                   /*!< Acknowledge error 5 interrupt enable */
#define DSI_IER0_AE6IE_Pos          (6U)
#define DSI_IER0_AE6IE_Msk          (0x1UL << DSI_IER0_AE6IE_Pos)         /*!< 0x00000040 */
#define DSI_IER0_AE6IE              DSI_IER0_AE6IE_Msk                   /*!< Acknowledge error 6 interrupt enable */
#define DSI_IER0_AE7IE_Pos          (7U)
#define DSI_IER0_AE7IE_Msk          (0x1UL << DSI_IER0_AE7IE_Pos)         /*!< 0x00000080 */
#define DSI_IER0_AE7IE              DSI_IER0_AE7IE_Msk                   /*!< Acknowledge error 7 interrupt enable */
#define DSI_IER0_AE8IE_Pos          (8U)
#define DSI_IER0_AE8IE_Msk          (0x1UL << DSI_IER0_AE8IE_Pos)         /*!< 0x00000100 */
#define DSI_IER0_AE8IE              DSI_IER0_AE8IE_Msk                   /*!< Acknowledge error 8 interrupt enable */
#define DSI_IER0_AE9IE_Pos          (9U)
#define DSI_IER0_AE9IE_Msk          (0x1UL << DSI_IER0_AE9IE_Pos)         /*!< 0x00000200 */
#define DSI_IER0_AE9IE              DSI_IER0_AE9IE_Msk                   /*!< Acknowledge error 9 interrupt enable */
#define DSI_IER0_AE10IE_Pos         (10U)
#define DSI_IER0_AE10IE_Msk         (0x1UL << DSI_IER0_AE10IE_Pos)        /*!< 0x00000400 */
#define DSI_IER0_AE10IE             DSI_IER0_AE10IE_Msk                  /*!< Acknowledge error 10 interrupt enable */
#define DSI_IER0_AE11IE_Pos         (11U)
#define DSI_IER0_AE11IE_Msk         (0x1UL << DSI_IER0_AE11IE_Pos)        /*!< 0x00000800 */
#define DSI_IER0_AE11IE             DSI_IER0_AE11IE_Msk                  /*!< Acknowledge error 11 interrupt enable */
#define DSI_IER0_AE12IE_Pos         (12U)
#define DSI_IER0_AE12IE_Msk         (0x1UL << DSI_IER0_AE12IE_Pos)        /*!< 0x00001000 */
#define DSI_IER0_AE12IE             DSI_IER0_AE12IE_Msk                  /*!< Acknowledge error 12 interrupt enable */
#define DSI_IER0_AE13IE_Pos         (13U)
#define DSI_IER0_AE13IE_Msk         (0x1UL << DSI_IER0_AE13IE_Pos)        /*!< 0x00002000 */
#define DSI_IER0_AE13IE             DSI_IER0_AE13IE_Msk                  /*!< Acknowledge error 13 interrupt enable */
#define DSI_IER0_AE14IE_Pos         (14U)
#define DSI_IER0_AE14IE_Msk         (0x1UL << DSI_IER0_AE14IE_Pos)        /*!< 0x00004000 */
#define DSI_IER0_AE14IE             DSI_IER0_AE14IE_Msk                  /*!< Acknowledge error 14 interrupt enable */
#define DSI_IER0_AE15IE_Pos         (15U)
#define DSI_IER0_AE15IE_Msk         (0x1UL << DSI_IER0_AE15IE_Pos)        /*!< 0x00008000 */
#define DSI_IER0_AE15IE             DSI_IER0_AE15IE_Msk                  /*!< Acknowledge error 15 interrupt enable */
#define DSI_IER0_PE0IE_Pos          (16U)
#define DSI_IER0_PE0IE_Msk          (0x1UL << DSI_IER0_PE0IE_Pos)         /*!< 0x00010000 */
#define DSI_IER0_PE0IE              DSI_IER0_PE0IE_Msk                   /*!< PHY error 0 interrupt enable */
#define DSI_IER0_PE1IE_Pos          (17U)
#define DSI_IER0_PE1IE_Msk          (0x1UL << DSI_IER0_PE1IE_Pos)         /*!< 0x00020000 */
#define DSI_IER0_PE1IE              DSI_IER0_PE1IE_Msk                   /*!< PHY error 1 interrupt enable */
#define DSI_IER0_PE2IE_Pos          (18U)
#define DSI_IER0_PE2IE_Msk          (0x1UL << DSI_IER0_PE2IE_Pos)         /*!< 0x00040000 */
#define DSI_IER0_PE2IE              DSI_IER0_PE2IE_Msk                   /*!< PHY error 2 interrupt enable */
#define DSI_IER0_PE3IE_Pos          (19U)
#define DSI_IER0_PE3IE_Msk          (0x1UL << DSI_IER0_PE3IE_Pos)         /*!< 0x00080000 */
#define DSI_IER0_PE3IE              DSI_IER0_PE3IE_Msk                   /*!< PHY error 3 interrupt enable */
#define DSI_IER0_PE4IE_Pos          (20U)
#define DSI_IER0_PE4IE_Msk          (0x1UL << DSI_IER0_PE4IE_Pos)         /*!< 0x00100000 */
#define DSI_IER0_PE4IE              DSI_IER0_PE4IE_Msk                   /*!< PHY error 4 interrupt enable */

/*******************  Bit definition for DSI_IER1 register  *******************/
#define DSI_IER1_TOHSTXIE_Pos       (0U)
#define DSI_IER1_TOHSTXIE_Msk       (0x1UL << DSI_IER1_TOHSTXIE_Pos)      /*!< 0x00000001 */
#define DSI_IER1_TOHSTXIE           DSI_IER1_TOHSTXIE_Msk                /*!< Timeout high-speed transmission interrupt enable */
#define DSI_IER1_TOLPRXIE_Pos       (1U)
#define DSI_IER1_TOLPRXIE_Msk       (0x1UL << DSI_IER1_TOLPRXIE_Pos)      /*!< 0x00000002 */
#define DSI_IER1_TOLPRXIE           DSI_IER1_TOLPRXIE_Msk                /*!< Timeout low-power reception interrupt enable */
#define DSI_IER1_ECCSEIE_Pos        (2U)
#define DSI_IER1_ECCSEIE_Msk        (0x1UL << DSI_IER1_ECCSEIE_Pos)       /*!< 0x00000004 */
#define DSI_IER1_ECCSEIE            DSI_IER1_ECCSEIE_Msk                 /*!< ECC single-bit error interrupt enable */
#define DSI_IER1_ECCMEIE_Pos        (3U)
#define DSI_IER1_ECCMEIE_Msk        (0x1UL << DSI_IER1_ECCMEIE_Pos)       /*!< 0x00000008 */
#define DSI_IER1_ECCMEIE            DSI_IER1_ECCMEIE_Msk                 /*!< ECC multi-bit error interrupt enable */
#define DSI_IER1_CRCEIE_Pos         (4U)
#define DSI_IER1_CRCEIE_Msk         (0x1UL << DSI_IER1_CRCEIE_Pos)        /*!< 0x00000010 */
#define DSI_IER1_CRCEIE             DSI_IER1_CRCEIE_Msk                  /*!< CRC error interrupt enable */
#define DSI_IER1_PSEIE_Pos          (5U)
#define DSI_IER1_PSEIE_Msk          (0x1UL << DSI_IER1_PSEIE_Pos)         /*!< 0x00000020 */
#define DSI_IER1_PSEIE              DSI_IER1_PSEIE_Msk                   /*!< Packet size error interrupt enable */
#define DSI_IER1_EOTPEIE_Pos        (6U)
#define DSI_IER1_EOTPEIE_Msk        (0x1UL << DSI_IER1_EOTPEIE_Pos)       /*!< 0x00000040 */
#define DSI_IER1_EOTPEIE            DSI_IER1_EOTPEIE_Msk                 /*!< EoTp error interrupt enable */
#define DSI_IER1_LPWREIE_Pos        (7U)
#define DSI_IER1_LPWREIE_Msk        (0x1UL << DSI_IER1_LPWREIE_Pos)       /*!< 0x00000080 */
#define DSI_IER1_LPWREIE            DSI_IER1_LPWREIE_Msk                 /*!< LTDC payload write error interrupt enable */
#define DSI_IER1_GCWREIE_Pos        (8U)
#define DSI_IER1_GCWREIE_Msk        (0x1UL << DSI_IER1_GCWREIE_Pos)       /*!< 0x00000100 */
#define DSI_IER1_GCWREIE            DSI_IER1_GCWREIE_Msk                 /*!< Generic command write error interrupt enable */
#define DSI_IER1_GPWREIE_Pos        (9U)
#define DSI_IER1_GPWREIE_Msk        (0x1UL << DSI_IER1_GPWREIE_Pos)       /*!< 0x00000200 */
#define DSI_IER1_GPWREIE            DSI_IER1_GPWREIE_Msk                 /*!< Generic payload write error interrupt enable */
#define DSI_IER1_GPTXEIE_Pos        (10U)
#define DSI_IER1_GPTXEIE_Msk        (0x1UL << DSI_IER1_GPTXEIE_Pos)       /*!< 0x00000400 */
#define DSI_IER1_GPTXEIE            DSI_IER1_GPTXEIE_Msk                 /*!< Generic payload transmit error interrupt enable */
#define DSI_IER1_GPRDEIE_Pos        (11U)
#define DSI_IER1_GPRDEIE_Msk        (0x1UL << DSI_IER1_GPRDEIE_Pos)       /*!< 0x00000800 */
#define DSI_IER1_GPRDEIE            DSI_IER1_GPRDEIE_Msk                 /*!< Generic payload read error interrupt enable */
#define DSI_IER1_GPRXEIE_Pos        (12U)
#define DSI_IER1_GPRXEIE_Msk        (0x1UL << DSI_IER1_GPRXEIE_Pos)       /*!< 0x00001000 */
#define DSI_IER1_GPRXEIE            DSI_IER1_GPRXEIE_Msk                 /*!< Generic payload receive error interrupt enable */
#define DSI_IER1_DCFFIE_Pos         (13U)
#define DSI_IER1_DCFFIE_Msk         (0x1UL << DSI_IER1_DCFFIE_Pos)        /*!< 0x00002000 */
#define DSI_IER1_DCFFIE             DSI_IER1_DCFFIE_Msk                  /*!< DBI command FIFO full error interrupt enable */
#define DSI_IER1_DDFFIE_Pos         (14U)
#define DSI_IER1_DDFFIE_Msk         (0x1UL << DSI_IER1_DDFFIE_Pos)        /*!< 0x00004000 */
#define DSI_IER1_DDFFIE             DSI_IER1_DDFFIE_Msk                  /*!< DBI data FIFO full error interrupt enable */
#define DSI_IER1_DRUIE_Pos          (15U)
#define DSI_IER1_DRUIE_Msk          (0x1UL << DSI_IER1_DRUIE_Pos)         /*!< 0x00008000 */
#define DSI_IER1_DRUIE              DSI_IER1_DRUIE_Msk                   /*!< DCS read underflow error interrupt enable */
#define DSI_IER1_DROIE_Pos          (16U)
#define DSI_IER1_DROIE_Msk          (0x1UL << DSI_IER1_DROIE_Pos)         /*!< 0x00010000 */
#define DSI_IER1_DROIE              DSI_IER1_DROIE_Msk                   /*!< DBI read overflow error interrupt enable */
#define DSI_IER1_DICIE_Pos          (17U)
#define DSI_IER1_DICIE_Msk          (0x1UL << DSI_IER1_DICIE_Pos)         /*!< 0x00020000 */
#define DSI_IER1_DICIE              DSI_IER1_DICIE_Msk                   /*!< DBI illegal command error interrupt enable */
#define DSI_IER1_VMPUIE_Pos         (19U)
#define DSI_IER1_VMPUIE_Msk         (0x1UL << DSI_IER1_VMPUIE_Pos)        /*!< 0x00080000 */
#define DSI_IER1_VMPUIE             DSI_IER1_VMPUIE_Msk                  /*!< Video mode underflow error interrupt enable */
#define DSI_IER1_TEIE_Pos           (20U)
#define DSI_IER1_TEIE_Msk           (0x1UL << DSI_IER1_TEIE_Pos)          /*!< 0x00100000 */
#define DSI_IER1_TEIE               DSI_IER1_TEIE_Msk                    /*!< Tear effect error interrupt enable */

/*******************  Bit definition for DSI_PCCR register  *******************/
#define DSI_PCCR_CSEN_Pos           (0U)
#define DSI_PCCR_CSEN_Msk           (0x1UL << DSI_PCCR_CSEN_Pos)          /*!< 0x00000001 */
#define DSI_PCCR_CSEN               DSI_PCCR_CSEN_Msk                    /*!< Calibration Start for the High-Speed Skew of the D-PHY: */

