STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255cxx_cm33.h
/******************  Bit definition for LVDS_SIDR register  *******************/
#define LVDS_SIDR_SID_Pos                                      (0U)
#define LVDS_SIDR_SID_Msk                                      (0xFFFFFFFFUL << LVDS_SIDR_SID_Pos)                               /*!< 0xFFFFFFFF */
#define LVDS_SIDR_SID                                          LVDS_SIDR_SID_Msk                                                /*!< LVDS PHY Host address space: 8kB (4kB for Host, 4kB for PHY/Wrapper) */
#define LVDS_SIDR_SID_0                                        (0x1UL << LVDS_SIDR_SID_Pos)                                      /*!< 0x00000001 */
#define LVDS_SIDR_SID_1                                        (0x2UL << LVDS_SIDR_SID_Pos)                                      /*!< 0x00000002 */
#define LVDS_SIDR_SID_2                                        (0x4UL << LVDS_SIDR_SID_Pos)                                      /*!< 0x00000004 */
#define LVDS_SIDR_SID_3                                        (0x8UL << LVDS_SIDR_SID_Pos)                                      /*!< 0x00000008 */
#define LVDS_SIDR_SID_4                                        (0x10UL << LVDS_SIDR_SID_Pos)                                     /*!< 0x00000010 */
#define LVDS_SIDR_SID_5                                        (0x20UL << LVDS_SIDR_SID_Pos)                                     /*!< 0x00000020 */
#define LVDS_SIDR_SID_6                                        (0x40UL << LVDS_SIDR_SID_Pos)                                     /*!< 0x00000040 */
#define LVDS_SIDR_SID_7                                        (0x80UL << LVDS_SIDR_SID_Pos)                                     /*!< 0x00000080 */
#define LVDS_SIDR_SID_8                                        (0x100UL << LVDS_SIDR_SID_Pos)                                    /*!< 0x00000100 */
#define LVDS_SIDR_SID_9                                        (0x200UL << LVDS_SIDR_SID_Pos)                                    /*!< 0x00000200 */
#define LVDS_SIDR_SID_10                                       (0x400UL << LVDS_SIDR_SID_Pos)                                    /*!< 0x00000400 */
#define LVDS_SIDR_SID_11                                       (0x800UL << LVDS_SIDR_SID_Pos)                                    /*!< 0x00000800 */
#define LVDS_SIDR_SID_12                                       (0x1000UL << LVDS_SIDR_SID_Pos)                                   /*!< 0x00001000 */
#define LVDS_SIDR_SID_13                                       (0x2000UL << LVDS_SIDR_SID_Pos)                                   /*!< 0x00002000 */
#define LVDS_SIDR_SID_14                                       (0x4000UL << LVDS_SIDR_SID_Pos)                                   /*!< 0x00004000 */
#define LVDS_SIDR_SID_15                                       (0x8000UL << LVDS_SIDR_SID_Pos)                                   /*!< 0x00008000 */
#define LVDS_SIDR_SID_16                                       (0x10000UL << LVDS_SIDR_SID_Pos)                                  /*!< 0x00010000 */
#define LVDS_SIDR_SID_17                                       (0x20000UL << LVDS_SIDR_SID_Pos)                                  /*!< 0x00020000 */
#define LVDS_SIDR_SID_18                                       (0x40000UL << LVDS_SIDR_SID_Pos)                                  /*!< 0x00040000 */
#define LVDS_SIDR_SID_19                                       (0x80000UL << LVDS_SIDR_SID_Pos)                                  /*!< 0x00080000 */
#define LVDS_SIDR_SID_20                                       (0x100000UL << LVDS_SIDR_SID_Pos)                                 /*!< 0x00100000 */
#define LVDS_SIDR_SID_21                                       (0x200000UL << LVDS_SIDR_SID_Pos)                                 /*!< 0x00200000 */
#define LVDS_SIDR_SID_22                                       (0x400000UL << LVDS_SIDR_SID_Pos)                                 /*!< 0x00400000 */
#define LVDS_SIDR_SID_23                                       (0x800000UL << LVDS_SIDR_SID_Pos)                                 /*!< 0x00800000 */
#define LVDS_SIDR_SID_24                                       (0x1000000UL << LVDS_SIDR_SID_Pos)                                /*!< 0x01000000 */
#define LVDS_SIDR_SID_25                                       (0x2000000UL << LVDS_SIDR_SID_Pos)                                /*!< 0x02000000 */
#define LVDS_SIDR_SID_26                                       (0x4000000UL << LVDS_SIDR_SID_Pos)                                /*!< 0x04000000 */
#define LVDS_SIDR_SID_27                                       (0x8000000UL << LVDS_SIDR_SID_Pos)                                /*!< 0x08000000 */
#define LVDS_SIDR_SID_28                                       (0x10000000UL << LVDS_SIDR_SID_Pos)                               /*!< 0x10000000 */
#define LVDS_SIDR_SID_29                                       (0x20000000UL << LVDS_SIDR_SID_Pos)                               /*!< 0x20000000 */
#define LVDS_SIDR_SID_30                                       (0x40000000UL << LVDS_SIDR_SID_Pos)                               /*!< 0x40000000 */
#define LVDS_SIDR_SID_31                                       (0x80000000UL << LVDS_SIDR_SID_Pos)                               /*!< 0x80000000 */
/******************************************************************************/
/*                                                                            */
/*                                 MDF/ADF                                    */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for MDF/ADF_GCR register  ********************/
#define MDF_GCR_TRGO_Pos                    (0U)
#define MDF_GCR_TRGO_Msk                    (0x1UL << MDF_GCR_TRGO_Pos)             /*!< 0x00000001 */
#define MDF_GCR_TRGO                        MDF_GCR_TRGO_Msk                        /*!<Trigger output control */
#define MDF_GCR_ILVNB_Pos                   (4U)
#define MDF_GCR_ILVNB_Msk                   (0xFUL << MDF_GCR_ILVNB_Pos)            /*!< 0x000000F0 */
#define MDF_GCR_ILVNB                       MDF_GCR_ILVNB_Msk                       /*!< Interleaved Number */

