STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255cxx_cm33.h
/* Bit fields for USB3_GSTS register */
#define USB3_GSTS_CURMOD_Pos                                     0
#define USB3_GSTS_CURMOD_Msk                                     (0x3UL << 0)
#define USB3_GSTS_CURMOD                                         (0x3UL << 0)
#define USB3_GSTS_BUSERRADDRVLD_Pos                              4
#define USB3_GSTS_BUSERRADDRVLD_Msk                              (0x1UL << 4)
#define USB3_GSTS_BUSERRADDRVLD                                  (0x1UL << 4)
#define USB3_GSTS_CSRTimeout_Pos                                 5
#define USB3_GSTS_CSRTimeout_Msk                                 (0x1UL << 5)
#define USB3_GSTS_CSRTimeout                                     (0x1UL << 5)
#define USB3_GSTS_Device_IP_Pos                                  6
#define USB3_GSTS_Device_IP_Msk                                  (0x1UL << 6)
#define USB3_GSTS_Device_IP                                      (0x1UL << 6)
#define USB3_GSTS_Host_IP_Pos                                    7
#define USB3_GSTS_Host_IP_Msk                                    (0x1UL << 7)
#define USB3_GSTS_Host_IP                                        (0x1UL << 7)
#define USB3_GSTS_ADP_IP_Pos                                     8
#define USB3_GSTS_ADP_IP_Msk                                     (0x1UL << 8)
#define USB3_GSTS_ADP_IP                                         (0x1UL << 8)
#define USB3_GSTS_BC_IP_Pos                                      9
#define USB3_GSTS_BC_IP_Msk                                      (0x1UL << 9)
#define USB3_GSTS_BC_IP                                          (0x1UL << 9)
#define USB3_GSTS_OTG_IP_Pos                                     10
#define USB3_GSTS_OTG_IP_Msk                                     (0x1UL << 10)
#define USB3_GSTS_OTG_IP                                         (0x1UL << 10)
#define USB3_GSTS_SSIC_IP_Pos                                    11
#define USB3_GSTS_SSIC_IP_Msk                                    (0x1UL << 11)
#define USB3_GSTS_SSIC_IP                                        (0x1UL << 11)
#define USB3_GSTS_CBELT_Pos                                      20
#define USB3_GSTS_CBELT_Msk                                      (0xfffUL << 20)
#define USB3_GSTS_CBELT                                          (0xfffUL << 20)

/* Bit fields for USB3_GUCTL1 register */
#define USB3_GUCTL1_LOA_FILTER_EN_Pos                            0
#define USB3_GUCTL1_LOA_FILTER_EN_Msk                            (0x1UL << 0)
#define USB3_GUCTL1_LOA_FILTER_EN                                (0x1UL << 0)
#define USB3_GUCTL1_OVRLD_L1_SUSP_COM_Pos                        1
#define USB3_GUCTL1_OVRLD_L1_SUSP_COM_Msk                        (0x1UL << 1)
#define USB3_GUCTL1_OVRLD_L1_SUSP_COM                            (0x1UL << 1)
#define USB3_GUCTL1_HC_PARCHK_DISABLE_Pos                        2
#define USB3_GUCTL1_HC_PARCHK_DISABLE_Msk                        (0x1UL << 2)
#define USB3_GUCTL1_HC_PARCHK_DISABLE                            (0x1UL << 2)
#define USB3_GUCTL1_HC_ERRATA_ENABLE_Pos                         3
#define USB3_GUCTL1_HC_ERRATA_ENABLE_Msk                         (0x1UL << 3)
#define USB3_GUCTL1_HC_ERRATA_ENABLE                             (0x1UL << 3)
#define USB3_GUCTL1_L1_SUSP_THRLD_FOR_HOST_Pos                   4
#define USB3_GUCTL1_L1_SUSP_THRLD_FOR_HOST_Msk                   (0xfUL << 4)
#define USB3_GUCTL1_L1_SUSP_THRLD_FOR_HOST                       (0xfUL << 4)
#define USB3_GUCTL1_L1_SUSP_THRLD_EN_FOR_HOST_Pos                8
#define USB3_GUCTL1_L1_SUSP_THRLD_EN_FOR_HOST_Msk                (0x1UL << 8)
#define USB3_GUCTL1_L1_SUSP_THRLD_EN_FOR_HOST                    (0x1UL << 8)
#define USB3_GUCTL1_DEV_HS_NYET_BULK_SPR_Pos                     9
#define USB3_GUCTL1_DEV_HS_NYET_BULK_SPR_Msk                     (0x1UL << 9)
#define USB3_GUCTL1_DEV_HS_NYET_BULK_SPR                         (0x1UL << 9)
#define USB3_GUCTL1_RESUME_OPMODE_HS_HOST_Pos                    10
#define USB3_GUCTL1_RESUME_OPMODE_HS_HOST_Msk                    (0x1UL << 10)
#define USB3_GUCTL1_RESUME_OPMODE_HS_HOST                        (0x1UL << 10)
#define USB3_GUCTL1_PARKMODE_DISABLE_FSLS_Pos                    15
#define USB3_GUCTL1_PARKMODE_DISABLE_FSLS_Msk                    (0x1UL << 15)
#define USB3_GUCTL1_PARKMODE_DISABLE_FSLS                        (0x1UL << 15)
#define USB3_GUCTL1_PARKMODE_DISABLE_HS_Pos                      16
#define USB3_GUCTL1_PARKMODE_DISABLE_HS_Msk                      (0x1UL << 16)
#define USB3_GUCTL1_PARKMODE_DISABLE_HS                          (0x1UL << 16)
#define USB3_GUCTL1_PARKMODE_DISABLE_SS_Pos                      17
#define USB3_GUCTL1_PARKMODE_DISABLE_SS_Msk                      (0x1UL << 17)
#define USB3_GUCTL1_PARKMODE_DISABLE_SS                          (0x1UL << 17)
#define USB3_GUCTL1_NAK_PER_ENH_HS_Pos                           18
#define USB3_GUCTL1_NAK_PER_ENH_HS_Msk                           (0x1UL << 18)
#define USB3_GUCTL1_NAK_PER_ENH_HS                               (0x1UL << 18)
#define USB3_GUCTL1_NAK_PER_ENH_FS_Pos                           19
#define USB3_GUCTL1_NAK_PER_ENH_FS_Msk                           (0x1UL << 19)
#define USB3_GUCTL1_NAK_PER_ENH_FS                               (0x1UL << 19)
#define USB3_GUCTL1_DEV_LSP_TAIL_LOCK_DIS_Pos                    20
#define USB3_GUCTL1_DEV_LSP_TAIL_LOCK_DIS_Msk                    (0x1UL << 20)
#define USB3_GUCTL1_DEV_LSP_TAIL_LOCK_DIS                        (0x1UL << 20)
#define USB3_GUCTL1_IP_GAP_ADD_ON_Pos                            21
#define USB3_GUCTL1_IP_GAP_ADD_ON_Msk                            (0x7UL << 21)
#define USB3_GUCTL1_IP_GAP_ADD_ON                                (0x7UL << 21)
#define USB3_GUCTL1_DEV_L1_EXIT_BY_HW_Pos                        24
#define USB3_GUCTL1_DEV_L1_EXIT_BY_HW_Msk                        (0x1UL << 24)
#define USB3_GUCTL1_DEV_L1_EXIT_BY_HW                            (0x1UL << 24)
#define USB3_GUCTL1_P3_IN_U2_Pos                                 25
#define USB3_GUCTL1_P3_IN_U2_Msk                                 (0x1UL << 25)
#define USB3_GUCTL1_P3_IN_U2                                     (0x1UL << 25)
#define USB3_GUCTL1_DEV_FORCE_20_CLK_FOR_30_CLK_Pos              26
#define USB3_GUCTL1_DEV_FORCE_20_CLK_FOR_30_CLK_Msk              (0x1UL << 26)
#define USB3_GUCTL1_DEV_FORCE_20_CLK_FOR_30_CLK                  (0x1UL << 26)
#define USB3_GUCTL1_DEV_TRB_OUT_SPR_IND_Pos                      27
#define USB3_GUCTL1_DEV_TRB_OUT_SPR_IND_Msk                      (0x1UL << 27)
#define USB3_GUCTL1_DEV_TRB_OUT_SPR_IND                          (0x1UL << 27)
#define USB3_GUCTL1_TX_IPGAP_LINECHECK_DIS_Pos                   28
#define USB3_GUCTL1_TX_IPGAP_LINECHECK_DIS_Msk                   (0x1UL << 28)
#define USB3_GUCTL1_TX_IPGAP_LINECHECK_DIS                       (0x1UL << 28)
#define USB3_GUCTL1_FILTER_SE0_FSLS_EOP_Pos                      29
#define USB3_GUCTL1_FILTER_SE0_FSLS_EOP_Msk                      (0x1UL << 29)
#define USB3_GUCTL1_FILTER_SE0_FSLS_EOP                          (0x1UL << 29)
#define USB3_GUCTL1_DS_RXDET_MAX_TOUT_CTRL_Pos                   30
#define USB3_GUCTL1_DS_RXDET_MAX_TOUT_CTRL_Msk                   (0x1UL << 30)
#define USB3_GUCTL1_DS_RXDET_MAX_TOUT_CTRL                       (0x1UL << 30)
#define USB3_GUCTL1_DEV_DECOUPLE_L1L2_EVT_Pos                    31
#define USB3_GUCTL1_DEV_DECOUPLE_L1L2_EVT_Msk                    (0x1UL << 31)
#define USB3_GUCTL1_DEV_DECOUPLE_L1L2_EVT                        (0x1UL << 31)

